exports.data = [
{ value: '01007101', label: '01007101 พืชสวนเพื่อคุณภาพชีวิตและสิ่งแวดล้อม ' },
{ value: '01009102', label: '01009102 ทรัพยากรการเกษตรและสิ่งแวดล้อม ' },
{ value: '01240011', label: '01240011 การออกแบบในชีวิตประจำวัน ' },
{ value: '01255101', label: '01255101 มนุษย์กับทะเล ' },
{ value: '01376101', label: '01376101 วรรณกรรมกับชีวิต ' },
{ value: '01420201', label: '01420201 อัญมณีและเครื่องประดับ ' },
{ value: '01999034', label: '01999034 ศิลปวิจักษณ์ ' },
{ value: '01999035', label: '01999035 วัฒนธรรมดนตรีกับชีวิต ' },
{ value: '02708102', label: '02708102 วรรณกรรมกับวิทยาศาสตร์ ' },
{ value: '03600012', label: '03600012 เทคโนโลยีสีเขียว ' },
{ value: '03751111', label: '03751111 มนุษย์กับสิ่งแวดล้อม ' },
]