exports.data = [
{ value: '01005101', label: '01005101 เทคโนโลยีเกษตรสมัยใหม่ ' },
{ value: '01132101', label: '01132101 ผู้ประกอบการรุ่นใหม่ ' },
{ value: '01200101', label: '01200101 การคิดเชิงนวัตกรรม ' },
{ value: '01999041', label: '01999041 เศรษฐศาสตร์เพื่อการดำเนินชีวิตที่ดี ' },
{ value: '01999043', label: '01999043 การคิดสร้างสรรค์เพื่อการจัดการคุณค่า ' },
{ value: '02717011', label: '02717011 ตนและการพัฒนาตน ' },
{ value: '03600014', label: '03600014 การแก้ปัญหาเชิงสร้างสรรค์และทักษะการคิดเชิงวิพากษ์ ' },
{ value: '03757123', label: '03757123 คณิตศาสตร์สำหรับธุรกิจ ' },
];